app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page:params[:page], per_page:2)
	@last5= Article.last(5)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Article one"], ["content", "sad"], ["created_at", "2022-05-24 21:26:03.900304"], ["updated_at", "2022-05-24 21:26:03.900304"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?