app/controllers/comments_controller.rb

	def create
		 @article = Article.find(params[:article_id])
		 @comment = @article.comments.create(params[:comment].permit(:body))
		 @comment.user_id = current_user.id if current_user

		 if @comment.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["user_id", 1], ["article_id", 1], ["created_at", "2022-05-24 20:11:38.514672"], ["updated_at", "2022-05-24 20:11:38.514672"]]

	def update
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])

		if @comment.update(params[:comment].permit(:body))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "Very nice blog"], ["updated_at", "2022-05-24 21:08:27.715580"], ["id", 2]]

	def edit
		@article= Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 2], ["LIMIT", 1]]