app/controllers/contacts_controller.rb

 def create
 	@contact = Contact.new(contact_params)

 if @contact.save
---
INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["message", ""], ["created_at", "2022-05-24 15:22:19.781923"], ["updated_at", "2022-05-24 15:22:19.781923"]]