app/controllers/pages_controller.rb

  def index
	  if current_user
		  redirect_to articles_path
	  end
	  @articles = Article.all
---
SELECT "articles".* FROM "articles"